<?php
//LoftSchool HT2
require('src/functions.php');

//=====================================================================
echo '<br>';
echo '<b>Задание #1</b>';
echo '<br>';
//Задание #1

$array_of_strings_real=['Первая строка', 'Вторая строка','Третья строка',' Слон','Тигр'];
task1($array_of_strings_real);
echo '<br>'; 
echo(task1($array_of_strings_real,true));
echo '<br>'; 

//=====================================================================
echo '<br>';
echo '<b>Задание #2</b>';
echo '<br>';
//Задание #2

echo '<br>';
echo 'task2("+", 1, 2, 3, 5.2)';
echo '<br>';
echo task2("+", 1, 2, 3, 5.2);
echo '<br>';

//=====================================================================
echo '<br>';
echo '<b>Задание #3</b>';
echo '<br>';
//Задание #3
echo 'task3(10.0,5)' .'<br>';
echo task3(10.0,5) .'<br>';

//=====================================================================
echo '<br>';
echo '<b>Задание #4</b>';
echo '<br>';
//Задание #4
// Задание #4 (выполняется после просмотра модуля “ВСТРОЕННЫЕ ВОЗМОЖНОСТИ ЯЗЫКА”)

// Выведите информацию о текущей дате в формате 31.12.2016 23:59
// Выведите unixtime время соответствующее 24.02.2016 00:00:00.

//=====================================================================
echo '<br>';
echo '<b>Задание #5</b>';
echo '<br>';
//Задание #5
// Задание #5 (выполняется после просмотра модуля “ВСТРОЕННЫЕ ВОЗМОЖНОСТИ ЯЗЫКА”)

// Дана строка: “Карл у Клары украл Кораллы”. Удалить из этой строки все заглавные буквы “К”.
// Дана строка: “Две бутылки лимонада”. Заменить “Две”, на “Три”.

?>